OpenFOAM/foam9tutorials/interfluo/Canonical-Flows/jet/case1/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1);

boundaryField
{
    inlet1
    {
        type            fixedValue;
        value           uniform (0 0 15);
    }
	
	inlet2
    {
        type            fixedValue;
        value           uniform (0 0 1);
    }
	
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
	
	wall
    {
        type            slip;
    }


}

// ************************************************************************* //
